Revit 2024 API
ParameterUtils.GetParameterTypeId Method
 Gets the ForgeTypeId identifying the built-in parameter corresponding to the given BuiltInParameter value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId GetParameterTypeId(
	BuiltInParameter builtInParam
)
Visual Basic
Public Shared Function GetParameterTypeId ( _
	builtInParam As BuiltInParameter _
) As ForgeTypeId
Visual C++
public:
static ForgeTypeId^ GetParameterTypeId(
	BuiltInParameter builtInParam
)
Parameters
builtInParam
Type: Autodesk.Revit.DB.BuiltInParameter
The BuiltInParameter value.
Return Value
Identifier of the parameter corresponding to the given BuiltInParameter value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
ParameterUtils Class
Autodesk.Revit.DB Namespace